#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mahen-terraform/kubernetes-ops-staging-10-vpc/runs/run-hwxzoCmPiDnXx1my

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-043a7656207fd9e0b]
module.vpc.module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-07ecd7fdffcfc6401]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-05664c5b542136237]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00d15c628c51984e6]
module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-019243a7e1a519f72]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-032cab67cf3edf3b5]
module.vpc.module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-061abedc8d9157a9c]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06d8e6f78eac7a0d1]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00e27aa0ffed5d30f]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04c93a3609498907a]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-075a66da07db55fb6]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0545cd8a2fd975a47]
module.vpc.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-065e6c2c11d9db7d5]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0833a850d459faab5]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f44e62fd0909a106]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c0b93469007bc61d]
module.vpc.module.vpc.aws_subnet.elasticache[2]: Refreshing state... [id=subnet-060231b87b0b4d7fa]
module.vpc.module.vpc.aws_subnet.elasticache[1]: Refreshing state... [id=subnet-0cdcbf1f429f54500]
module.vpc.module.vpc.aws_subnet.elasticache[0]: Refreshing state... [id=subnet-081ef1c8f881f4b65]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cd43ea0bab0ec6e2]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a5931532f316e36d]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0e878a138c2214f5e]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-034c0e2a4911bbbab]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08b15046cf505bc54]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00df65448307564c4]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-073eee4de90b76d92]
module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0]: Refreshing state... [id=staging]
module.vpc.module.vpc.aws_route_table_association.elasticache[2]: Refreshing state... [id=rtbassoc-0142b9ae6c151a304]
module.vpc.module.vpc.aws_route_table_association.elasticache[0]: Refreshing state... [id=rtbassoc-0f4e13c3fa960790e]
module.vpc.module.vpc.aws_route_table_association.elasticache[1]: Refreshing state... [id=rtbassoc-03fd01584c7d9cb63]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-06c58ecc75d694422]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0706a3a49b4d88f4c]
module.vpc.module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-00354e38de0a2a598]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c0b93469007bc61d1080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-065e6c2c11d9db7d51080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f44e62fd0909a1061080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-04c93a3609498907a1080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.module.vpc.aws_eip.nat[0] has been deleted
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-00d15c628c51984e6" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-00d15c628c51984e6" -> null
      - network_border_group = "us-east-1" -> null
      - public_dns           = "ec2-54-86-144-170.compute-1.amazonaws.com" -> null
      - public_ip            = "54.86.144.170" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name"                 = "staging-us-east-1a"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all             = {
          - "Name"                 = "staging-us-east-1a"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.module.vpc.aws_eip.nat[1] has been deleted
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-05664c5b542136237" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-05664c5b542136237" -> null
      - network_border_group = "us-east-1" -> null
      - public_dns           = "ec2-18-233-255-191.compute-1.amazonaws.com" -> null
      - public_ip            = "18.233.255.191" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name"                 = "staging-us-east-1c"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all             = {
          - "Name"                 = "staging-us-east-1c"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.module.vpc.aws_eip.nat[2] has been deleted
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-07ecd7fdffcfc6401" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-07ecd7fdffcfc6401" -> null
      - network_border_group = "us-east-1" -> null
      - public_dns           = "ec2-18-213-239-152.compute-1.amazonaws.com" -> null
      - public_ip            = "18.213.239.152" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name"                 = "staging-us-east-1d"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all             = {
          - "Name"                 = "staging-us-east-1d"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0] has been deleted
  - resource "aws_elasticache_subnet_group" "elasticache" {
      - arn         = "arn:aws:elasticache:us-east-1:415873801866:subnetgroup:staging" -> null
      - description = "ElastiCache subnet group for staging" -> null
      - id          = "staging" -> null
      - name        = "staging" -> null
      - subnet_ids  = [
          - "subnet-060231b87b0b4d7fa",
          - "subnet-081ef1c8f881f4b65",
          - "subnet-0cdcbf1f429f54500",
        ] -> null
      - tags        = {
          - "Name"                 = "staging"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all    = {
          - "Name"                 = "staging"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-east-1:415873801866:internet-gateway/igw-0cd43ea0bab0ec6e2" -> null
      - id       = "igw-0cd43ea0bab0ec6e2" -> null
      - owner_id = "415873801866" -> null
      - tags     = {
          - "Name"                 = "staging"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all = {
          - "Name"                 = "staging"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id   = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] has been deleted
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-00d15c628c51984e6" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-06c58ecc75d694422" -> null
      - network_interface_id = "eni-053b10ede84ea0f23" -> null
      - private_ip           = "10.0.101.16" -> null
      - public_ip            = "54.86.144.170" -> null
      - subnet_id            = "subnet-0545cd8a2fd975a47" -> null
      - tags                 = {
          - "Name"                 = "staging-us-east-1a"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all             = {
          - "Name"                 = "staging-us-east-1a"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[1] has been deleted
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-05664c5b542136237" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-0706a3a49b4d88f4c" -> null
      - network_interface_id = "eni-0993418b07202fda7" -> null
      - private_ip           = "10.0.102.88" -> null
      - public_ip            = "18.233.255.191" -> null
      - subnet_id            = "subnet-00e27aa0ffed5d30f" -> null
      - tags                 = {
          - "Name"                 = "staging-us-east-1c"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all             = {
          - "Name"                 = "staging-us-east-1c"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[2] has been deleted
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-07ecd7fdffcfc6401" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-00354e38de0a2a598" -> null
      - network_interface_id = "eni-0b6fe5e5f6558e79a" -> null
      - private_ip           = "10.0.103.217" -> null
      - public_ip            = "18.213.239.152" -> null
      - subnet_id            = "subnet-0833a850d459faab5" -> null
      - tags                 = {
          - "Name"                 = "staging-us-east-1d"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all             = {
          - "Name"                 = "staging-us-east-1d"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] has been deleted
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0f44e62fd0909a1061080289494" -> null
      - nat_gateway_id         = "nat-06c58ecc75d694422" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0f44e62fd0909a106" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[1] has been deleted
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-04c93a3609498907a1080289494" -> null
      - nat_gateway_id         = "nat-0706a3a49b4d88f4c" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-04c93a3609498907a" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[2] has been deleted
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-065e6c2c11d9db7d51080289494" -> null
      - nat_gateway_id         = "nat-00354e38de0a2a598" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-065e6c2c11d9db7d5" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-0cd43ea0bab0ec6e2" -> null
      - id                     = "r-rtb-0c0b93469007bc61d1080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0c0b93469007bc61d" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:415873801866:route-table/rtb-0f44e62fd0909a106" -> null
      - id               = "rtb-0f44e62fd0909a106" -> null
      - owner_id         = "415873801866" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"                 = "staging-private-us-east-1a"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all         = {
          - "Name"                 = "staging-private-us-east-1a"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id           = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_route_table.private[1] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:415873801866:route-table/rtb-04c93a3609498907a" -> null
      - id               = "rtb-04c93a3609498907a" -> null
      - owner_id         = "415873801866" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"                 = "staging-private-us-east-1c"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all         = {
          - "Name"                 = "staging-private-us-east-1c"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id           = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_route_table.private[2] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:415873801866:route-table/rtb-065e6c2c11d9db7d5" -> null
      - id               = "rtb-065e6c2c11d9db7d5" -> null
      - owner_id         = "415873801866" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"                 = "staging-private-us-east-1d"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all         = {
          - "Name"                 = "staging-private-us-east-1d"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id           = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_route_table.public[0] has been deleted
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:415873801866:route-table/rtb-0c0b93469007bc61d" -> null
      - id               = "rtb-0c0b93469007bc61d" -> null
      - owner_id         = "415873801866" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"                 = "staging-public"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all         = {
          - "Name"                 = "staging-public"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id           = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[0] has been deleted
  - resource "aws_route_table_association" "elasticache" {
      - id             = "rtbassoc-0f4e13c3fa960790e" -> null
      - route_table_id = "rtb-0f44e62fd0909a106" -> null
      - subnet_id      = "subnet-081ef1c8f881f4b65" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[1] has been deleted
  - resource "aws_route_table_association" "elasticache" {
      - id             = "rtbassoc-03fd01584c7d9cb63" -> null
      - route_table_id = "rtb-04c93a3609498907a" -> null
      - subnet_id      = "subnet-0cdcbf1f429f54500" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[2] has been deleted
  - resource "aws_route_table_association" "elasticache" {
      - id             = "rtbassoc-0142b9ae6c151a304" -> null
      - route_table_id = "rtb-065e6c2c11d9db7d5" -> null
      - subnet_id      = "subnet-060231b87b0b4d7fa" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0a5931532f316e36d" -> null
      - route_table_id = "rtb-0f44e62fd0909a106" -> null
      - subnet_id      = "subnet-075a66da07db55fb6" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.private[1] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-034c0e2a4911bbbab" -> null
      - route_table_id = "rtb-04c93a3609498907a" -> null
      - subnet_id      = "subnet-06d8e6f78eac7a0d1" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.private[2] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0e878a138c2214f5e" -> null
      - route_table_id = "rtb-065e6c2c11d9db7d5" -> null
      - subnet_id      = "subnet-032cab67cf3edf3b5" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-08b15046cf505bc54" -> null
      - route_table_id = "rtb-0c0b93469007bc61d" -> null
      - subnet_id      = "subnet-0545cd8a2fd975a47" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.public[1] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-00df65448307564c4" -> null
      - route_table_id = "rtb-0c0b93469007bc61d" -> null
      - subnet_id      = "subnet-00e27aa0ffed5d30f" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.public[2] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-073eee4de90b76d92" -> null
      - route_table_id = "rtb-0c0b93469007bc61d" -> null
      - subnet_id      = "subnet-0833a850d459faab5" -> null
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[0] has been deleted
  - resource "aws_subnet" "elasticache" {
      - arn                                            = "arn:aws:ec2:us-east-1:415873801866:subnet/subnet-081ef1c8f881f4b65" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "100.64.0.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-081ef1c8f881f4b65" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "415873801866" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                            = "staging-elasticache-us-east-1a"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_purpose"                     = "Overloaded for k8s worker usage"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                                       = {
          - "Name"                            = "staging-elasticache-us-east-1a"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_purpose"                     = "Overloaded for k8s worker usage"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id                                         = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[1] has been deleted
  - resource "aws_subnet" "elasticache" {
      - arn                                            = "arn:aws:ec2:us-east-1:415873801866:subnet/subnet-0cdcbf1f429f54500" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "100.64.16.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0cdcbf1f429f54500" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "415873801866" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                            = "staging-elasticache-us-east-1c"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_purpose"                     = "Overloaded for k8s worker usage"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                                       = {
          - "Name"                            = "staging-elasticache-us-east-1c"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_purpose"                     = "Overloaded for k8s worker usage"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id                                         = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[2] has been deleted
  - resource "aws_subnet" "elasticache" {
      - arn                                            = "arn:aws:ec2:us-east-1:415873801866:subnet/subnet-060231b87b0b4d7fa" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "100.64.32.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-060231b87b0b4d7fa" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "415873801866" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                            = "staging-elasticache-us-east-1d"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_purpose"                     = "Overloaded for k8s worker usage"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                                       = {
          - "Name"                            = "staging-elasticache-us-east-1d"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_purpose"                     = "Overloaded for k8s worker usage"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id                                         = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_subnet.private[0] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:415873801866:subnet/subnet-075a66da07db55fb6" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-075a66da07db55fb6" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "415873801866" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                            = "staging-private-us-east-1a"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                                       = {
          - "Name"                            = "staging-private-us-east-1a"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id                                         = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_subnet.private[1] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:415873801866:subnet/subnet-06d8e6f78eac7a0d1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-06d8e6f78eac7a0d1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "415873801866" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                            = "staging-private-us-east-1c"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                                       = {
          - "Name"                            = "staging-private-us-east-1c"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id                                         = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_subnet.private[2] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:415873801866:subnet/subnet-032cab67cf3edf3b5" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-032cab67cf3edf3b5" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "415873801866" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                            = "staging-private-us-east-1d"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                                       = {
          - "Name"                            = "staging-private-us-east-1d"
          - "kubernetes.io/cluster/staging"   = "shared"
          - "kubernetes.io/role/internal-elb" = "1"
          - "ops_env"                         = "staging"
          - "ops_managed_by"                  = "terraform"
          - "ops_owners"                      = "devops"
          - "ops_source_repo"                 = "kubernetes-ops"
          - "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id                                         = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_subnet.public[0] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:415873801866:subnet/subnet-0545cd8a2fd975a47" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.101.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0545cd8a2fd975a47" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "415873801866" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                          = "staging-public-us-east-1a"
          - "kubernetes.io/cluster/staging" = "shared"
          - "kubernetes.io/role/elb"        = "1"
          - "ops_env"                       = "staging"
          - "ops_managed_by"                = "terraform"
          - "ops_owners"                    = "devops"
          - "ops_source_repo"               = "kubernetes-ops"
          - "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                                       = {
          - "Name"                          = "staging-public-us-east-1a"
          - "kubernetes.io/cluster/staging" = "shared"
          - "kubernetes.io/role/elb"        = "1"
          - "ops_env"                       = "staging"
          - "ops_managed_by"                = "terraform"
          - "ops_owners"                    = "devops"
          - "ops_source_repo"               = "kubernetes-ops"
          - "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id                                         = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_subnet.public[1] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:415873801866:subnet/subnet-00e27aa0ffed5d30f" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.102.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-00e27aa0ffed5d30f" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "415873801866" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                          = "staging-public-us-east-1c"
          - "kubernetes.io/cluster/staging" = "shared"
          - "kubernetes.io/role/elb"        = "1"
          - "ops_env"                       = "staging"
          - "ops_managed_by"                = "terraform"
          - "ops_owners"                    = "devops"
          - "ops_source_repo"               = "kubernetes-ops"
          - "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                                       = {
          - "Name"                          = "staging-public-us-east-1c"
          - "kubernetes.io/cluster/staging" = "shared"
          - "kubernetes.io/role/elb"        = "1"
          - "ops_env"                       = "staging"
          - "ops_managed_by"                = "terraform"
          - "ops_owners"                    = "devops"
          - "ops_source_repo"               = "kubernetes-ops"
          - "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id                                         = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_subnet.public[2] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:415873801866:subnet/subnet-0833a850d459faab5" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.103.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0833a850d459faab5" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "415873801866" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                          = "staging-public-us-east-1d"
          - "kubernetes.io/cluster/staging" = "shared"
          - "kubernetes.io/role/elb"        = "1"
          - "ops_env"                       = "staging"
          - "ops_managed_by"                = "terraform"
          - "ops_owners"                    = "devops"
          - "ops_source_repo"               = "kubernetes-ops"
          - "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                                       = {
          - "Name"                          = "staging-public-us-east-1d"
          - "kubernetes.io/cluster/staging" = "shared"
          - "kubernetes.io/role/elb"        = "1"
          - "ops_env"                       = "staging"
          - "ops_managed_by"                = "terraform"
          - "ops_owners"                    = "devops"
          - "ops_source_repo"               = "kubernetes-ops"
          - "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id                                         = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_vpc.this[0] has been deleted
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:us-east-1:415873801866:vpc/vpc-043a7656207fd9e0b" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-022be86c78daa6f45" -> null
      - default_route_table_id               = "rtb-0f155c9dbb606eccf" -> null
      - default_security_group_id            = "sg-0f52eff2e1b9f5c05" -> null
      - dhcp_options_id                      = "dopt-0775e900871d4b6a7" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-043a7656207fd9e0b" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0f155c9dbb606eccf" -> null
      - owner_id                             = "415873801866" -> null
      - tags                                 = {
          - "Name"                 = "staging"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all                             = {
          - "Name"                 = "staging"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
    }

  # module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] has been deleted
  - resource "aws_vpc_ipv4_cidr_block_association" "this" {
      - cidr_block = "100.64.0.0/16" -> null
      - id         = "vpc-cidr-assoc-019243a7e1a519f72" -> null
      - vpc_id     = "vpc-043a7656207fd9e0b" -> null
    }

  # module.vpc.module.vpc.aws_vpn_gateway.this[0] has been deleted
  - resource "aws_vpn_gateway" "this" {
      - amazon_side_asn = "64512" -> null
      - arn             = "arn:aws:ec2:us-east-1:415873801866:vpn-gateway/vgw-061abedc8d9157a9c" -> null
      - id              = "vgw-061abedc8d9157a9c" -> null
      - tags            = {
          - "Name"                 = "staging"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - tags_all        = {
          - "Name"                 = "staging"
          - "ops_env"              = "staging"
          - "ops_managed_by"       = "terraform"
          - "ops_owners"           = "devops"
          - "ops_source_repo"      = "kubernetes-ops"
          - "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        } -> null
      - vpc_id          = "vpc-043a7656207fd9e0b" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc                  = true
    }

  # module.vpc.module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc                  = true
    }

  # module.vpc.module.vpc.aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc                  = true
    }

  # module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0] will be created
  + resource "aws_elasticache_subnet_group" "elasticache" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group for staging"
      + id          = (known after apply)
      + name        = "staging"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all    = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-private-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-private-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-private-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-private-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-private-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-private-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-public"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-public"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[0] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[1] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[2] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[0] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-elasticache-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-elasticache-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[1] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-elasticache-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-elasticache-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[2] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-elasticache-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-elasticache-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-private-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-private-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-private-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-private-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-private-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-private-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                          = "staging-public-us-east-1a"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                          = "staging-public-us-east-1a"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                          = "staging-public-us-east-1c"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                          = "staging-public-us-east-1c"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                          = "staging-public-us-east-1d"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                          = "staging-public-us-east-1d"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                             = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "100.64.0.0/16"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpn_gateway.this[0] will be created
  + resource "aws_vpn_gateway" "this" {
      + amazon_side_asn = "64512"
      + arn             = (known after apply)
      + id              = (known after apply)
      + tags            = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all        = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id          = (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ k8s_subnets     = [
      - "subnet-081ef1c8f881f4b65",
      - "subnet-0cdcbf1f429f54500",
      - "subnet-060231b87b0b4d7fa",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ private_subnets = [
      - "subnet-075a66da07db55fb6",
      - "subnet-06d8e6f78eac7a0d1",
      - "subnet-032cab67cf3edf3b5",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ public_subnets  = [
      - "subnet-0545cd8a2fd975a47",
      - "subnet-00e27aa0ffed5d30f",
      - "subnet-0833a850d459faab5",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ vpc_id          = "vpc-043a7656207fd9e0b" -> (known after apply)

```


</details>

*Pusher: @nmahendran-aws, Action: `pull_request`*